In [4]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /home/sergiomess/anaconda3/lib/python3.8/site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in /home/sergiomess/anaconda3/lib/python3.8/site-packages (from mysql-connector-python) (3.20.0)

In [5]:
import mysql.connector as conn
import pandas as pd

In [8]:
crea_db=conn.connect(host='localhost', user='root', passwd='admin')

cursor=crea_db.cursor()

cursor.execute('drop database if exists movies;')
cursor.execute('create database movies;')

In [10]:
db=conn.connect(host='localhost', user='root', passwd='admin', database='movies')

cursor=db.cursor()

In [12]:
actor=pd.read_csv ('Data/actor.csv')
actor=actor.drop(['last_update'], axis=1)
actor

     actor_id first_name     last_name
0           1   PENELOPE       GUINESS
1           2       NICK      WAHLBERG
2           3         ED         CHASE
3           4   JENNIFER         DAVIS
4           5     JOHNNY  LOLLOBRIGIDA
..        ...        ...           ...
195       196       BELA        WALKEN
196       197      REESE          WEST
197       198       MARY        KEITEL
198       199      JULIA       FAWCETT
199       200      THORA        TEMPLE

[200 rows x 3 columns]

In [13]:
cursor.execute('drop table if exists actor;')



tabla='''

        create table actor (
            
            actor_id int primary key,
            first_name varchar(50),
            last_name varchar(50)
            
        );

'''


cursor.execute(tabla)

In [14]:
for i in range(len(actor)):
    
    insert_query='insert into {} ({}) values {};'\
                 .format('actor', ','.join(actor.columns), tuple(actor.iloc[i].values))
    
    
    insert_query=f"insert into actor ({','.join(actor.columns)}) values {tuple(actor.iloc[i].values)};"
    
    
    cursor.execute(insert_query)
    
    
db.commit()